app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "nj"], ["content", "oi"], ["created_at", "2023-05-12 00:59:50.548699"], ["updated_at", "2023-05-12 00:59:50.548699"], ["user_id", 3]]